tests/mutations/ha-duplicate-read-fanout.patch
diff --git a/components/espdesktop/ha_read_coordinator.h b/components/espdesktop/ha_read_coordinator.h
--- a/components/espdesktop/ha_read_coordinator.h
+++ b/components/espdesktop/ha_read_coordinator.h
@@ -237,6 +237,6 @@ class HaReadCoordinator {
     for (auto &request : deferred_) {
       if (request.generation == generation_ &&
-          request.channel == channel) {
+          request.channel != channel) {
         return queue_callback_ref(request.callbacks, std::move(callback));
       }
     }
